app/controllers/vitals_controller.rb

  def index
    @vitals = Vital.all
---
SELECT "vitals".* FROM "vitals" WHERE (date BETWEEN '2016-03-29' AND '2016-04-05')

  def create
    @vital = Vital.new(vital_params)

    respond_to do |format|
      if @vital.save
---
INSERT INTO "vitals" ("Patient_ID", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Patient_ID", 1], ["date", "2016-03-23 04:10:00.000000"], ["created_at", "2016-03-23 04:10:41.332247"], ["updated_at", "2016-03-23 04:10:41.332247"]]

    def set_vital
      @vital = Vital.find(params[:id])
---
SELECT  "vitals".* FROM "vitals" WHERE "vitals"."id" = ? LIMIT 1  [["id", 1]]